<a href="https://colab.research.google.com/github/RsdTanmoy/Machine-Learning-Pandas/blob/main/Pandas_Lecture_11(Concat_Function).ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

**Pandas Concate() Function**

In [ ]:
import pandas as pd

In [ ]:
sr1=pd.Series([0,1,2])
sr1

0    0
1    1
2    2
dtype: int64

In [ ]:
sr2=pd.Series([3,4,5])
sr2

0    3
1    4
2    5
dtype: int64

In [ ]:
sr3=pd.Series([3,4,5,6,7])
sr3

0    3
1    4
2    5
3    6
4    7
dtype: int64

**Concatenate Multiple Series**

In [ ]:
pd.concat([sr1,sr2])

0    0
1    1
2    2
0    3
1    4
2    5
dtype: int64

In [ ]:
pd.concat([sr1,sr3])

0    0
1    1
2    2
0    3
1    4
2    5
3    6
4    7
dtype: int64

**Concatenate Multiple DataFrames**

In [ ]:
df1 = pd.DataFrame({'ID':[1,2,3,4],'Name':['A','B','C','D'],'Class':[5,6,7,8]})
df1

   ID Name  Class
0   1    A      5
1   2    B      6
2   3    C      7
3   4    D      8

In [ ]:
df2 = pd.DataFrame({'ID':[5,6,7,8],'Name':['E','F','G','H'],'Class':[9,10,11,12]})
df2

   ID Name  Class
0   5    E      9
1   6    F     10
2   7    G     11
3   8    H     12

In [ ]:
pd.concat([df1,df2])

   ID Name  Class
0   1    A      5
1   2    B      6
2   3    C      7
3   4    D      8
0   5    E      9
1   6    F     10
2   7    G     11
3   8    H     12

In [ ]:
pd.concat([df2,df1])

   ID Name  Class
0   5    E      9
1   6    F     10
2   7    G     11
3   8    H     12
0   1    A      5
1   2    B      6
2   3    C      7
3   4    D      8

**Pandas concat 'axis'**

In [ ]:
#column wise concat
pd.concat([df2,df1],axis=1)

   ID Name  Class  ID Name  Class
0   5    E      9   1    A      5
1   6    F     10   2    B      6
2   7    G     11   3    C      7
3   8    H     12   4    D      8

**Pandas concat 'ignore_index'**

In [ ]:
#row wise concat
pd.concat([df1,df2],axis=0,ignore_index=True)

   ID Name  Class
0   1    A      5
1   2    B      6
2   3    C      7
3   4    D      8
4   5    E      9
5   6    F     10
6   7    G     11
7   8    H     12

**Pandas concat join**

In [ ]:
df1 = pd.DataFrame({'ID':[1,2,3,4],'Name':['A','B','C','D'],'Class':[5,6,7,8]})
df1

   ID Name  Class
0   1    A      5
1   2    B      6
2   3    C      7
3   4    D      8

In [ ]:
df3 = pd.DataFrame({'ID':[3,4],'Name':['C','D'],'Class':[7,8]})
df3

   ID Name  Class
0   3    C      7
1   4    D      8

In [ ]:
pd.concat([df1,df3])

   ID Name  Class
0   1    A      5
1   2    B      6
2   3    C      7
3   4    D      8
0   3    C      7
1   4    D      8

In [ ]:
pd.concat([df1,df3],axis=1)

   ID Name  Class   ID Name  Class
0   1    A      5  3.0    C    7.0
1   2    B      6  4.0    D    8.0
2   3    C      7  NaN  NaN    NaN
3   4    D      8  NaN  NaN    NaN

In [ ]:
pd.concat([df1,df3],axis=1,join='inner')

   ID Name  Class  ID Name  Class
0   1    A      5   3    C      7
1   2    B      6   4    D      8

**Pandas concat keys**

In [ ]:
df1

   ID Name  Class
0   1    A      5
1   2    B      6
2   3    C      7
3   4    D      8

In [ ]:
df2

   ID Name  Class
0   5    E      9
1   6    F     10
2   7    G     11
3   8    H     12

In [ ]:
pd.concat([df1,df2],keys=['df1','df2'])

       ID Name  Class
df1 0   1    A      5
    1   2    B      6
    2   3    C      7
    3   4    D      8
df2 0   5    E      9
    1   6    F     10
    2   7    G     11
    3   8    H     12

In [ ]:
pd.concat([df1,df2],keys=['First_Dataframe','Second_Dataframe'])

                    ID Name  Class
First_Dataframe  0   1    A      5
                 1   2    B      6
                 2   3    C      7
                 3   4    D      8
Second_Dataframe 0   5    E      9
                 1   6    F     10
                 2   7    G     11
                 3   8    H     12

In [ ]:
pd.concat([df1,df2],axis=1,keys=['First_Dataframe','Second_Dataframe'])

  First_Dataframe            Second_Dataframe
               ID Name Class               ID Name Class
0               1    A     5                5    E     9
1               2    B     6                6    F    10
2               3    C     7                7    G    11
3               4    D     8                8    H    12

**Pandas concat sort**

In [ ]:
df1

   ID Name  Class
0   1    A      5
1   2    B      6
2   3    C      7
3   4    D      8

In [ ]:
df3=pd.DataFrame({'Marks':[80,89,90,67]})
df3

   Marks
0     80
1     89
2     90
3     67

In [ ]:
pd.concat([df1,df3])

    ID Name  Class  Marks
0  1.0    A    5.0    NaN
1  2.0    B    6.0    NaN
2  3.0    C    7.0    NaN
3  4.0    D    8.0    NaN
0  NaN  NaN    NaN   80.0
1  NaN  NaN    NaN   89.0
2  NaN  NaN    NaN   90.0
3  NaN  NaN    NaN   67.0

In [ ]:
pd.concat([df1,df3],sort=False)

    ID Name  Class  Marks
0  1.0    A    5.0    NaN
1  2.0    B    6.0    NaN
2  3.0    C    7.0    NaN
3  4.0    D    8.0    NaN
0  NaN  NaN    NaN   80.0
1  NaN  NaN    NaN   89.0
2  NaN  NaN    NaN   90.0
3  NaN  NaN    NaN   67.0